DevOpsOfChaos/esp32-smart-home/firmware/src/net_zrl/main.cpp
    nodeStatus.letztes_hello_ms = millis();
    return sendePaket(holeHelloZielMac(), SH_MSG_HELLO, &payload, sizeof(payload), "HELLO");
}

bool sendeHeartbeat() {
    if (!nodeStatus.master_mac_gueltig) {
        logf("WARN", "HEARTBEAT verschoben: Master-MAC unbekannt");
        return false;
    }

    SmartHome::HeartbeatPayload payload = {};
    copyText(payload.node_id, sizeof(payload.node_id), DEVICE_ID);
    payload.uptime_s = millis() / 1000UL;

    if (sendePaket(nodeStatus.master_mac, SH_MSG_HEARTBEAT, &payload, sizeof(payload), "HEARTBEAT")) {
        nodeStatus.letzter_heartbeat_ms = millis();
        return true;
    }

    return false;
}

bool sendeStateReport() {
    if (!nodeStatus.master_mac_gueltig) {
        logf("WARN", "STATE_REPORT wartet auf HELLO_ACK");
        return false;
    }

    SmartHome::ZrlStateReportPayload payload = {};
    copyText(payload.node_id, sizeof(payload.node_id), DEVICE_ID);
    payload.relay_1 = nodeStatus.relay_1 ? 1U : 0U;
    payload.relay_2 = nodeStatus.relay_2 ? 1U : 0U;
    payload.cover_mode = COVER_MODUS_AKTIV ? 1U : 0U;
    payload.cover_state = nodeStatus.cover_state;
    payload.cover_position = nodeStatus.cover_position;
    payload.fault = nodeStatus.fault ? 1U : 0U;

    if (sendePaket(nodeStatus.master_mac, SH_MSG_STATE, &payload, sizeof(payload), "STATE_REPORT")) {
        nodeStatus.state_report_offen = false;
        nodeStatus.letzter_state_ms = millis();
        return true;
    }

    return false;
}

bool sendeEvent(uint8_t eventType, uint8_t trigger, uint8_t param1, uint16_t param2) {
    if (!nodeStatus.master_mac_gueltig) {
        return false;
    }

    SmartHome::EventReportPayload payload = {};
    copyText(payload.node_id, sizeof(payload.node_id), DEVICE_ID);
    payload.event_type = eventType;
    payload.trigger = trigger;
    payload.param1 = param1;
    payload.param2 = param2;

    return sendePaket(nodeStatus.master_mac, SH_MSG_EVENT, &payload, sizeof(payload), "EVENT");
}

bool istDoppeltesCmd(uint8_t seq, const SmartHome::CmdPayload& cmd) {
    return nodeStatus.letzter_cmd_gueltig &&
           nodeStatus.letzter_cmd_seq == seq &&
           memcmp(&nodeStatus.letzter_cmd_payload, &cmd, sizeof(cmd)) == 0;
}

void schreibeRelaisPin(uint8_t relayIndex, bool einschalten) {
    if (relayIndex == 0U && PIN_RELAY_1 >= 0) {
        digitalWrite(PIN_RELAY_1, einschalten ? HIGH : LOW);
    }
    if (relayIndex == 1U && PIN_RELAY_2 >= 0) {
        digitalWrite(PIN_RELAY_2, einschalten ? HIGH : LOW);
    }
}

void aktualisiereCoverState() {
    if (!COVER_MODUS_AKTIV) {
        nodeStatus.cover_state = SH_COVER_STATE_STOPPED;
        nodeStatus.cover_position = 0xFFU;
        return;
    }

    if (nodeStatus.relay_1 && !nodeStatus.relay_2) {
        nodeStatus.cover_state = SH_COVER_STATE_MOVING_UP;
    } else if (nodeStatus.relay_2 && !nodeStatus.relay_1) {
        nodeStatus.cover_state = SH_COVER_STATE_MOVING_DOWN;
    } else {
        nodeStatus.cover_state = SH_COVER_STATE_STOPPED;
    }
}

bool manualAllowed(uint8_t buttonIndex) {
    switch (buttonIndex) {
        case 1U:
            return PIN_BUTTON_1 >= 0;
        case 2U:
            return PIN_BUTTON_2 >= 0;
        case 3U:
            return PIN_BUTTON_3 >= 0;
        default:
            return false;
    }
}

bool relayCommandAllowed(uint8_t relayIndex, uint8_t trigger) {
    if (relayIndex > 1U) return false;

    switch (trigger) {
        case SH_TRIGGER_MASTER_CMD:
            return true;
        case SH_TRIGGER_MANUAL_BUTTON:
            return manualAllowed((uint8_t)(relayIndex + 1U));
        default:
            return false;
    }
}

uint8_t relayEventType(uint8_t trigger, uint8_t relayIndex, bool einschalten) {
    if (COVER_MODUS_AKTIV) {
        if (!einschalten) {
            return SH_EVENT_COVER_STOP;
        }
        return relayIndex == 0U ? SH_EVENT_COVER_UP : SH_EVENT_COVER_DOWN;
    }
    (void)trigger;
    return SH_EVENT_RELAY_CHANGED;
}

bool schalteRelaisGesichert(uint8_t relayIndex, bool einschalten, uint8_t trigger, const char* quelle) {
    if (!relayCommandAllowed(relayIndex, trigger)) {
        logf("WARN", "Relais %u blockiert: unzulaessiger Trigger %u (%s)", (unsigned)(relayIndex + 1U), (unsigned)trigger, quelle);
        return false;
    }

    const bool warBereitsAn = (relayIndex == 0U) ? nodeStatus.relay_1 : nodeStatus.relay_2;

    if (COVER_MODUS_AKTIV && einschalten) {
        if ((relayIndex == 0U && nodeStatus.relay_2) || (relayIndex == 1U && nodeStatus.relay_1)) {
            logf("WARN", "Relais %u blockiert: Gegenrichtung aktiv (%s)", (unsigned)(relayIndex + 1U), quelle);
            return false;
        }
        if (nodeStatus.relais_verriegelt && millis() < nodeStatus.verriegelung_bis_ms) {
            logf("WARN", "Relais %u blockiert: Reversiersperrzeit aktiv", (unsigned)(relayIndex + 1U));
            return false;
        }
    }

    if (relayIndex == 0U) {
        nodeStatus.relay_1 = einschalten;
    } else {
        nodeStatus.relay_2 = einschalten;
    }

    schreibeRelaisPin(relayIndex, einschalten);
    aktualisiereCoverState();
    nodeStatus.state_report_offen = true;
    logf("INFO", "Relais %u -> %s (%s)", (unsigned)(relayIndex + 1U), einschalten ? "EIN" : "AUS", quelle);
    if (warBereitsAn != einschalten) {
        sendeEvent(relayEventType(trigger, relayIndex, einschalten), trigger, relayIndex, einschalten ? 1U : 0U);
    }
    return true;
}

bool stoppeFahrt(const char* quelle, uint8_t trigger) {
    const bool warAktiv = nodeStatus.relay_1 || nodeStatus.relay_2;

    nodeStatus.relay_1 = false;
    nodeStatus.relay_2 = false;
    schreibeRelaisPin(0U, false);
    schreibeRelaisPin(1U, false);
    aktualisiereCoverState();

    if (COVER_MODUS_AKTIV && warAktiv) {
        nodeStatus.relais_verriegelt = true;
        nodeStatus.verriegelung_bis_ms = millis() + COVER_REVERSE_LOCK_MS;
    }

    nodeStatus.state_report_offen = true;
    logf("INFO", "Cover-Stopp (%s)", quelle);
    if (warAktiv) {
        sendeEvent(SH_EVENT_COVER_STOP, trigger, 0U, 0U);
    }
    return true;
}

void aktualisiereRelaisVerriegelung() {
    if (!COVER_MODUS_AKTIV) {
        nodeStatus.relais_verriegelt = false;
        return;
    }

    if (nodeStatus.relais_verriegelt && millis() >= nodeStatus.verriegelung_bis_ms) {
        nodeStatus.relais_verriegelt = false;
    }
}

void initialisiereHardware() {
    if (PIN_STATUS_LED >= 0) {
        pinMode(PIN_STATUS_LED, OUTPUT);
        digitalWrite(PIN_STATUS_LED, LOW);
    }

    if (PIN_RELAY_1 >= 0) {
        pinMode(PIN_RELAY_1, OUTPUT);
        digitalWrite(PIN_RELAY_1, RELAY_1_DEFAULT_ON_BOOT ? HIGH : LOW);
    }
    if (PIN_RELAY_2 >= 0) {
        pinMode(PIN_RELAY_2, OUTPUT);
        digitalWrite(PIN_RELAY_2, RELAY_2_DEFAULT_ON_BOOT ? HIGH : LOW);
    }

    nodeStatus.relay_1 = RELAY_1_DEFAULT_ON_BOOT;
    nodeStatus.relay_2 = RELAY_2_DEFAULT_ON_BOOT;
    nodeStatus.cover_state = SH_COVER_STATE_STOPPED;
    nodeStatus.cover_position = 0xFFU;
    nodeStatus.fault = false;
    nodeStatus.state_report_offen = false;

    lokalerTaster1.begin();
    lokalerTaster2.begin();
    lokalerTaster3.begin();
}

void initialisiereFunk() {
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    WiFi.setSleep(false);

