DevOpsOfChaos/esp32-smart-home/firmware/src/net_zrl/main.cpp
    esp_err_t kanalErr = esp_wifi_set_channel((uint8_t)WLAN_KANAL, WIFI_SECOND_CHAN_NONE);
    if (kanalErr != ESP_OK) {
        logf("WARN", "WLAN-Kanal %d konnte nicht gesetzt werden (err=%d)", WLAN_KANAL, (int)kanalErr);
    }

    if (esp_now_init() != ESP_OK) {
        logf("WARN", "ESP-NOW Initialisierung fehlgeschlagen");
        return;
    }

    stellePeerSicher(BROADCAST_MAC);
    logf("INFO", "ESP-NOW bereit auf Kanal %d", WLAN_KANAL);
}

void gibStartmeldungAus() {
    if (!DEBUG_LOKAL_AKTIV) return;

    Serial.println("================================");
    Serial.println(PROJECT_NAME);
    Serial.print(DATEI_GERAET);
    Serial.print(" v");
    Serial.println(DATEI_VERSION);
    Serial.print("Node-ID: ");
    Serial.println(DEVICE_ID);
    Serial.print("Name: ");
    Serial.println(provisioning.deviceName());
    Serial.print("FW: ");
    Serial.println(PROJECT_VERSION);
    Serial.print("Variante: ");
    Serial.println(FW_VARIANT);
    Serial.print("Cover-Modus: ");
    Serial.println(COVER_MODUS_AKTIV ? "aktiv" : "inaktiv");
    Serial.println("================================");
}

void verarbeiteHelloAck(const uint8_t* senderMac, const SmartHome::HelloAckPayload& payload) {
    if (payload.ack_status != SH_ACK_OK) {
        logf("WARN", "HELLO_ACK abgelehnt");
        return;
    }

    memcpy(nodeStatus.master_mac, senderMac, 6);
    nodeStatus.master_mac_gueltig = true;
    nodeStatus.master_bekannt = true;
    provisioning.persistMasterMac(senderMac);
    stellePeerSicher(nodeStatus.master_mac);
    logf("INFO", "HELLO_ACK empfangen, Master-Kanal=%u", payload.channel);
    logMac("Master-MAC: ", senderMac);
    nodeStatus.state_report_offen = true;
}

void verarbeiteLokalenButtonEvent(
    uint8_t buttonIndex,
    const SmartHome::ShSensors::DigitalInputUpdate& update,
    const char* pressLabel,
    const char* stopLabel)
{
    if (!manualAllowed(buttonIndex)) {
        return;
    }

    if (update.activated()) {
        sendeEvent(SH_EVENT_BUTTON_PRESS, SH_TRIGGER_MANUAL_BUTTON, buttonIndex, 0U);

        if (COVER_MODUS_AKTIV) {
            if (buttonIndex == 1U) {
                if (nodeStatus.relay_1 && !nodeStatus.relay_2) {
                    stoppeFahrt(stopLabel, SH_TRIGGER_MANUAL_BUTTON);
                } else {
                    stoppeFahrt(stopLabel, SH_TRIGGER_MANUAL_BUTTON);
                    schalteRelaisGesichert(0U, true, SH_TRIGGER_MANUAL_BUTTON, pressLabel);
                }
            } else if (buttonIndex == 2U) {
                if (nodeStatus.relay_2 && !nodeStatus.relay_1) {
                    stoppeFahrt(stopLabel, SH_TRIGGER_MANUAL_BUTTON);
                } else {
                    stoppeFahrt(stopLabel, SH_TRIGGER_MANUAL_BUTTON);
                    schalteRelaisGesichert(1U, true, SH_TRIGGER_MANUAL_BUTTON, pressLabel);
                }
            } else if (buttonIndex == 3U) {
                stoppeFahrt(stopLabel, SH_TRIGGER_MANUAL_BUTTON);
            }
        } else {
            if (buttonIndex == 1U) {
                schalteRelaisGesichert(0U, !nodeStatus.relay_1, SH_TRIGGER_MANUAL_BUTTON, pressLabel);
            } else if (buttonIndex == 2U) {
                schalteRelaisGesichert(1U, !nodeStatus.relay_2, SH_TRIGGER_MANUAL_BUTTON, pressLabel);
            } else {
                logf("INFO", "Taster 3 ohne Funktion im allgemeinen Zwei-Relais-Modus");
            }
        }
    }

    if (update.longHold()) {
        sendeEvent(SH_EVENT_BUTTON_LONG_PRESS, SH_TRIGGER_MANUAL_BUTTON, buttonIndex, update.active_ms);
    }
    if (update.deactivated()) {
        sendeEvent(SH_EVENT_BUTTON_RELEASE, SH_TRIGGER_MANUAL_BUTTON, buttonIndex, update.active_ms);
    }
}

void verarbeiteLokaleTaster(unsigned long jetzt) {
    verarbeiteLokalenButtonEvent(1U, lokalerTaster1.poll(jetzt), "Lokaler Taster 1", "Lokaler Stop/Reset 1");
    verarbeiteLokalenButtonEvent(2U, lokalerTaster2.poll(jetzt), "Lokaler Taster 2", "Lokaler Stop/Reset 2");
    verarbeiteLokalenButtonEvent(3U, lokalerTaster3.poll(jetzt), "Lokaler Stop-Taster", "Lokaler Stop-Taster");
}

bool verarbeiteRelayCmd(const SmartHome::CmdPayload& cmd) {
    if (cmd.param1 > 1U) {
        logf("WARN", "Relay-CMD ignoriert: relay_index=%u", (unsigned)cmd.param1);
        return false;
    }

    bool einschalten = (cmd.param2 == 2U)
        ? (cmd.param1 == 0U ? !nodeStatus.relay_1 : !nodeStatus.relay_2)
        : (cmd.param2 == 1U);

    return schalteRelaisGesichert(cmd.param1, einschalten, SH_TRIGGER_MASTER_CMD, "Master-Kommando");
}

bool verarbeiteCoverCmd(const SmartHome::CmdPayload& cmd) {
    if (!COVER_MODUS_AKTIV) {
        logf("WARN", "Cover-CMD ignoriert: COVER_MODUS_AKTIV=false");
        return false;
    }

    switch (cmd.param1) {
        case SH_COVER_STATE_STOPPED:
            return stoppeFahrt("Cover-Stop", SH_TRIGGER_MASTER_CMD);
        case SH_COVER_STATE_MOVING_UP:
            stoppeFahrt("Cover-Auf", SH_TRIGGER_MASTER_CMD);
            return schalteRelaisGesichert(0U, true, SH_TRIGGER_MASTER_CMD, "Cover-Auf");
        case SH_COVER_STATE_MOVING_DOWN:
            stoppeFahrt("Cover-Ab", SH_TRIGGER_MASTER_CMD);
            return schalteRelaisGesichert(1U, true, SH_TRIGGER_MASTER_CMD, "Cover-Ab");
        default:
            logf("WARN", "Cover-CMD ignoriert: param1=%u", (unsigned)cmd.param1);
            return false;
    }
}

void verarbeiteCmd(const uint8_t* senderMac, const SmartHome::MsgHeader& header, const SmartHome::CmdPayload& cmd) {
    if (istDoppeltesCmd(header.seq, cmd)) {
        logf("WARN", "Duplikat-CMD erkannt (seq=%u)", (unsigned)header.seq);
        if (header.flags & SH_FLAG_ACK_REQUEST) {
            sendeAck(senderMac, header.seq, header.msg_type, SH_ACK_OK);
        }
        return;
    }

    bool erfolgreich = false;
    switch (cmd.cmd_type) {
        case SH_CMD_SET_RELAY:
            logf(
                "INFO",
                "COMMAND_SET_RELAY empfangen: relay_%u=%s%s",
                (unsigned)(cmd.param1 + 1U),
                (cmd.param2 == 2U)
                    ? "toggle"
                    : ((cmd.param2 == 1U) ? "true" : "false"),
                (header.flags & SH_FLAG_RETRANSMIT) ? " (retry)" : "");
            erfolgreich = verarbeiteRelayCmd(cmd);
            break;
        case SH_CMD_COVER:
            logf(
                "INFO",
                "COMMAND_COVER empfangen: state=%u%s",
                (unsigned)cmd.param1,
                (header.flags & SH_FLAG_RETRANSMIT) ? " (retry)" : "");
            erfolgreich = verarbeiteCoverCmd(cmd);
            break;
        case SH_CMD_STATE_REQUEST:
            nodeStatus.state_report_offen = true;
            erfolgreich = true;
            break;
        default:
            logf("WARN", "Unbekanntes CMD empfangen (cmd=%u)", (unsigned)cmd.cmd_type);
            erfolgreich = false;
            break;
    }

    if (!erfolgreich) {
        if (header.flags & SH_FLAG_ACK_REQUEST) {
            sendeAck(senderMac, header.seq, header.msg_type, SH_ACK_ERROR);
        }
        return;
    }

    nodeStatus.letzter_cmd_gueltig = true;
    nodeStatus.letzter_cmd_seq = header.seq;
    nodeStatus.letzter_cmd_payload = cmd;

